#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/MenofAWS/learn-terraform-github-actions/runs/run-RsyZTSvM1SF8uBjA

Waiting for the plan to start...

Terraform v1.10.3
on linux_amd64
Initializing plugins and modules...
aws_route_table_association.public-us-east-1c: Refreshing state... [id=rtbassoc-0e27f038b3a637d42]
aws_eip.nat: Refreshing state... [id=eipalloc-0e2bc5aca7afbfb4a]
aws_route_table_association.private-us-east-1c: Refreshing state... [id=rtbassoc-04d8a3825429414b3]
aws_route_table_association.private-us-east-1a: Refreshing state... [id=rtbassoc-05b52fb7bab1b887c]
aws_nat_gateway.nat: Refreshing state... [id=nat-01d58a2a6af529fbd]
aws_launch_template.app1_LT: Refreshing state... [id=lt-050be2b8156895f23]
aws_subnet.private-us-east-1c: Refreshing state... [id=subnet-03b3549ab45fd82da]
aws_route_table.private: Refreshing state... [id=rtb-05454d3a3e79d202b]
aws_vpc.app1: Refreshing state... [id=vpc-02c17492fbc99d9bc]
aws_route_table.public: Refreshing state... [id=rtb-0155909ffd9f5827b]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e65138c6d03db4d9]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-018a5439f72c6453e]
data.aws_ami.amazon-linux-ami: Refreshing...
aws_route_table_association.public-us-east-1a: Refreshing state... [id=rtbassoc-0baa270fb9936f0f4]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-05b791139d5c1bfac]
aws_route_table_association.public-us-east-1b: Refreshing state... [id=rtbassoc-01df93659ec908df5]
aws_security_group.app1-sg01-servers: Refreshing state... [id=sg-01358a7c85e326cf3]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-0ce8107c10d1b7e3d]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-082d613de6e3bb4ab]
aws_route_table_association.private-us-east-1b: Refreshing state... [id=rtbassoc-0cd7e021a1c80371f]
aws_subnet.public-us-east-1c: Refreshing state... [id=subnet-0a0defed58fb91da1]
data.aws_ami.amazon-linux-ami: Refresh complete after 0s [id=ami-09115b7bffbe3c5e4]
aws_route_table_association.public-us-east-1c: Drift detected (delete)
aws_subnet.private-us-east-1a: Drift detected (delete)
aws_security_group.app1-sg01-servers: Drift detected (delete)
aws_route_table_association.public-us-east-1b: Drift detected (delete)
aws_internet_gateway.igw: Drift detected (delete)
aws_vpc.app1: Drift detected (delete)
aws_route_table_association.private-us-east-1c: Drift detected (delete)
aws_launch_template.app1_LT: Drift detected (delete)
aws_route_table.public: Drift detected (delete)
aws_subnet.public-us-east-1a: Drift detected (delete)
aws_subnet.private-us-east-1b: Drift detected (delete)
aws_route_table.private: Drift detected (delete)
aws_eip.nat: Drift detected (delete)
aws_nat_gateway.nat: Drift detected (delete)
aws_route_table_association.private-us-east-1b: Drift detected (delete)
aws_subnet.public-us-east-1b: Drift detected (delete)
aws_route_table_association.private-us-east-1a: Drift detected (delete)
aws_subnet.private-us-east-1c: Drift detected (delete)
aws_subnet.public-us-east-1c: Drift detected (delete)
aws_route_table_association.public-us-east-1a: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-09115b7bffbe3c5e4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "619f46e1b7f7f7aee4c7eb55e53b4a9091830020"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ibnayyassu, Action: `pull_request`*